// data/campusGraph.js
module.exports = {
  nodes: [
    { id: "N1",  name: "P1",  lat: 41.858614, lng: 123.790701 },
    { id: "N2",  name: "P2",  lat: 41.857588, lng: 123.790921 },
    { id: "N3",  name: "P3",  lat: 41.856073, lng: 123.791157 },
    { id: "N4",  name: "P4",  lat: 41.855399, lng: 123.791262 },
    { id: "N5",  name: "P5",  lat: 41.855172, lng: 123.791293 },
    { id: "N6",  name: "P6",  lat: 41.854575, lng: 123.791393 },
    { id: "N7",  name: "P7",  lat: 41.854329, lng: 123.791443 },

    { id: "N8",  name: "P8",  lat: 41.853949, lng: 123.791503 },
    { id: "N9",  name: "P9",  lat: 41.853590, lng: 123.791538 },

    { id: "N10", name: "P10", lat: 41.857376, lng: 123.788325 },
    { id: "N11", name: "P11", lat: 41.857452, lng: 123.789327 },
    { id: "N12", name: "P12", lat: 41.857750, lng: 123.792455 },
    { id: "N13", name: "P13", lat: 41.857862, lng: 123.793859 }
  ],

  // 无向边（只写一次，localAStar.js里会自动补双向）
  edges: [
    // 纵向主干：1-2-3-4-5-6-7-8-9
    { a: "N1", b: "N2" },
    { a: "N2", b: "N3" },
    { a: "N3", b: "N4" },
    { a: "N4", b: "N5" },
    { a: "N5", b: "N6" },
    { a: "N6", b: "N7" },
    { a: "N7", b: "N8" },
    { a: "N8", b: "N9" },

    // 横向主干：10-11-2-12-13
    { a: "N10", b: "N11" },
    { a: "N11", b: "N2" },
    { a: "N2",  b: "N12" },
    { a: "N12", b: "N13" }
  ]
};